Repository: xcv58/MacTools
Catalog: Plugins/AIAssistant/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# settings.prompt.shortcutImmediateDescription
source: 快捷键更改立即生效。
ar: تسري تغييرات الاختصار على الفور.
de: Änderungen an Tastaturkürzeln werden sofort wirksam.
en: Shortcut changes take effect immediately.
es: Los cambios en los atajos de teclado se aplican inmediatamente.
fr: Les modifications de raccourci prennent effet immédiatement.
ja: ショートカットの変更はすぐに有効になります。
ko: 단축키 변경사항은 즉시 적용됩니다.
pt: As alterações nos atalhos entram em vigor imediatamente.
ru: Изменения сочетаний клавиш вступают в силу немедленно.
tr: Kısayol değişiklikleri anında etkili olur.
zh_hant: 快速鍵更改立即生效。

# settings.capture.title
source: 划词捕获
ar: التقاط التحديد
de: Auswahl erfassen
en: Selection Capture
es: Captura de selección
fr: Capture de sélection
ja: 選択テキストの取得
ko: 선택 캡처
pt: Captura de seleção
ru: Захват выделенного текста
tr: Seçim Yakalama
zh_hant: 選取文字擷取

# settings.capture.simulatedCopy.title
source: 允许模拟复制
ar: السماح بمحاكاة النسخ
de: Simuliertes Kopieren erlauben
en: Allow Simulated Copy
es: Permitir copia simulada
fr: Autoriser la copie simulée
ja: コピー操作のシミュレーションを許可
ko: 복사 동작 시뮬레이션 허용
pt: Permitir cópia simulada
ru: Разрешить имитацию копирования
tr: Simüle Edilen Kopyalamaya İzin Ver
zh_hant: 允許模擬拷貝

# settings.capture.simulatedCopy.description
source: 直接读取失败时模拟 ⌘C；复制内容可能进入剪贴板历史。
ar: محاكاة ⌘C عند فشل الالتقاط المباشر. قد يدخل المحتوى المنسوخ إلى سجل الحافظة.
de: ⌘C simulieren, wenn die direkte Erfassung fehlschlägt. Kopierte Inhalte können im Zwischenablageverlauf landen.
en: Simulate ⌘C when direct capture fails. Copied content may enter Clipboard History.
es: Simule ⌘C cuando falla la captura directa. El contenido copiado puede ingresar al historial del portapapeles.
fr: Simulez ⌘C lorsque la capture directe échoue. Le contenu copié peut entrer dans l'historique du Presse-papiers.
ja: 直接キャプチャが失敗した場合に ⌘C をシミュレートします。コピーされたコンテンツがクリップボード履歴に記録される場合があります。
ko: 직접 캡처 실패 시 ⌘C를 시뮬레이션합니다. 복사한 콘텐츠가 클립보드 기록에 들어갈 수 있습니다.
pt: Simule ⌘C quando a captura direta falhar. O conteúdo copiado pode entrar no histórico da área de transferência.
ru: Имитация ⌘C при сбое прямого захвата. Скопированный контент может попасть в историю буфера обмена.
tr: Doğrudan yakalama başarısız olduğunda ⌘C simüle edilir. Kopyalanan içerik pano geçmişine girebilir.
zh_hant: 直接讀取失敗時模擬 ⌘C；拷貝內容可能進入剪貼簿歷史。

# action.unavailable.paused
source: AI 助手快捷键已暂停。
ar: تم إيقاف اختصارات مساعد الذكاء الاصطناعي مؤقتًا.
de: Die Tastenkombinationen des KI-Assistenten sind pausiert.
en: AI Assistant shortcuts are paused.
es: Los atajos de teclado del Asistente de IA están en pausa.
fr: Les raccourcis de l’Assistant IA sont suspendus.
ja: AI アシスタントのショートカットが一時停止されています。
ko: AI 어시스턴트 단축키가 일시중지되었습니다.
pt: Os atalhos do Assistente de IA estão pausados.
ru: Сочетания клавиш ИИ-ассистента приостановлены.
tr: Yapay Zekâ Asistanı kısayolları duraklatıldı.
zh_hant: AI 助手快速鍵已暫停。

# action.unavailable.accessibility
source: 需要辅助功能授权。
ar: يلزم منح إذن تسهيلات الاستخدام.
de: Bedienungshilfen-Berechtigung erforderlich.
en: Accessibility permission is required.
es: Se requiere permiso de accesibilidad.
fr: L’autorisation d’accessibilité est requise.
ja: アクセシビリティの許可が必要です。
ko: 손쉬운 사용 권한이 필요합니다.
pt: A permissão de acessibilidade é necessária.
ru: Требуется разрешение на универсальный доступ.
tr: Erişilebilirlik izni gerekli.
zh_hant: 需要輔助使用權限。

# action.unavailable.provider
source: 请先配置 AI 服务。
ar: قم بتكوين خدمة الذكاء الاصطناعي أولاً.
de: Konfigurieren Sie zuerst einen KI-Dienst.
en: Configure an AI service first.
es: Primero configure un servicio de IA.
fr: Configurez d'abord un service IA.
ja: 先に AI サービスを設定してください。
ko: 먼저 AI 서비스를 구성하세요.
pt: Configure primeiro um serviço de IA.
ru: Сначала настройте службу ИИ.
tr: Önce bir yapay zekâ servisi yapılandırın.
zh_hant: 請先設定 AI 服務。

# common.cancel
source: 取消
ar: إلغاء
de: Abbrechen
en: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
tr: İptal

# common.delete
source: 删除
ar: حذف
de: Löschen
en: Delete
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
pt: Excluir
ru: Удалить
tr: Sil
zh_hant: 刪除

# metadata.title
source: AI 助手
ar: مساعد الذكاء الاصطناعي
de: KI-Assistent
en: AI Assistant
es: Asistente de IA
fr: Assistant IA
ja: AIアシスタント
ko: AI 어시스턴트
pt: Assistente de IA
ru: ИИ-ассистент
tr: Yapay Zekâ Asistanı

# metadata.description
source: 划词调用 AI 翻译、总结、润色等
ar: عالج النص المحدد بالذكاء الاصطناعي: ترجمة وتلخيص وتحسين وغير ذلك.
de: Verarbeite ausgewählten Text mit KI: Übersetzen, Zusammenfassen, Überarbeiten und mehr.
en: Process selected text with AI: translate, summarize, polish, and more.
es: Procesa el texto seleccionado con IA: traducir, resumir, pulir y más.
fr: Traitez le texte sélectionné avec l’IA : traduisez, résumez, améliorez le style, etc.
ja: 選択したテキストをAIで処理：翻訳、要約、推敲など。
ko: 선택한 텍스트를 AI로 처리: 번역, 요약, 다듬기 등.
pt: Processe o texto selecionado com IA: traduza, resuma, aprimore e muito mais.
ru: Обрабатывайте выделенный текст с помощью ИИ: переводите, кратко излагайте, редактируйте и выполняйте другие задачи.
tr: Seçili metni yapay zekâ ile işleyin: çevirin, özetleyin, iyileştirin ve daha fazlası.
zh_hant: 透過快速鍵呼叫 AI 翻譯、摘要、潤飾等

# permission.accessibility.title
source: 辅助功能授权
ar: تسهيلات الاستخدام
de: Bedienungshilfen
en: Accessibility
es: Accesibilidad
fr: Accessibilité
ja: アクセシビリティ
ko: 손쉬운 사용
pt: Acessibilidade
ru: Универсальный доступ
tr: Erişilebilirlik
zh_hant: 輔助使用權限

# permission.accessibility.description
source: 划词处理需要读取当前选中文本。
ar: تتطلب معالجة النص المحدد قراءة التحديد الحالي.
de: Die Verarbeitung von ausgewähltem Text erfordert das Auslesen der aktuellen Auswahl.
en: Processing selected text requires reading the current selection.
es: El procesamiento del texto seleccionado requiere leer la selección actual.
fr: Le traitement du texte sélectionné nécessite la lecture de la sélection en cours.
ja: 選択したテキストを処理するには、現在の選択内容を読み取る必要があります。
ko: 선택한 텍스트를 처리하려면 현재 선택 항목을 읽어야 합니다.
pt: O processamento do texto selecionado requer a leitura da seleção atual.
ru: Для обработки выделенного текста требуется чтение текущего выделения.
tr: Seçili metni işlemek, geçerli seçimin okunmasını gerektirir.
zh_hant: 劃詞處理需要讀取目前選取的文字。

# permission.accessibility.footnote
source: 前往系统设置 → 隐私与安全性 → 辅助功能，授权 MacTools。
ar: افتح إعدادات النظام ← الخصوصية والأمن ← تسهيلات الاستخدام، ثم اسمح لـ MacTools.
de: Öffne Systemeinstellungen → Datenschutz & Sicherheit → Bedienungshilfen und erlaube MacTools den Zugriff.
en: Open System Settings → Privacy & Security → Accessibility and allow MacTools.
es: Abre Ajustes del Sistema → Privacidad y seguridad → Accesibilidad y permite MacTools.
fr: Ouvrez Réglages Système → Confidentialité et sécurité → Accessibilité, puis autorisez MacTools.
ja: システム設定 → プライバシーとセキュリティ → アクセシビリティで MacTools を許可してください。
ko: 시스템 설정 → 개인정보 보호 및 보안 → 손쉬운 사용에서 MacTools를 허용하세요.
pt: Abra Ajustes do Sistema → Privacidade e Segurança → Acessibilidade e permita o MacTools.
ru: Откройте Системные настройки → Конфиденциальность и безопасность → Универсальный доступ и разрешите доступ для MacTools.
tr: Sistem Ayarları → Gizlilik ve Güvenlik → Erişilebilirlik bölümünü açın ve MacTools'a izin verin.
zh_hant: 前往系統設定 → 隱私與安全性 → 輔助使用，授權 MacTools。

# permission.automation.title
source: 自动化授权
ar: التحكم التلقائي
de: Automation
en: Automation
es: Automatización
fr: Automatisation
ja: オートメーション
ko: 자동화
pt: Automação
ru: Автоматизация
tr: Otomasyon
zh_hant: 自動化權限

# permission.automation.description
source: 浏览器划词可能需要允许 MacTools 控制当前浏览器。
ar: قد يتطلب التقاط النص المحدد في المتصفح السماح لـ MacTools بالتحكم في المتصفح الحالي.
de: Für das Erfassen von Text im Browser muss MacTools möglicherweise die Steuerung des aktuellen Browsers gestattet werden.
en: Reading selected browser text may require allowing MacTools to control the browser.
es: Leer el texto seleccionado en el navegador puede requerir permitir que MacTools controle el navegador actual.
fr: La capture du texte sélectionné dans un navigateur peut nécessiter d’autoriser MacTools à contrôler ce navigateur.
ja: ブラウザで選択したテキストを取得するには、MacTools にそのブラウザの制御を許可する必要がある場合があります。
ko: 브라우저에서 선택한 텍스트를 읽으려면 MacTools가 현재 브라우저를 제어하도록 허용해야 할 수도 있습니다.
pt: A captura de texto selecionado no navegador pode exigir permissão para o MacTools controlar o navegador atual.
ru: Для чтения выделенного текста в браузере может потребоваться разрешить MacTools управлять этим браузером.
tr: Tarayıcıdaki seçimi okumak, MacTools'un geçerli tarayıcıyı denetlemesine izin verilmesini gerektirebilir.
zh_hant: 瀏覽器劃詞可能需要允許 MacTools 控制目前瀏覽器。

# permission.automation.footnote
source: MacTools 首次控制浏览器时，macOS 会请求自动化授权。
ar: سيطلب macOS إذن التحكم التلقائي عندما يتحكم MacTools في المتصفح للمرة الأولى.
de: macOS fragt bei der ersten Steuerung eines Browsers nach der Berechtigung „Automation“.
en: macOS will ask for Automation permission the first time MacTools controls a browser.
es: macOS solicitará permiso de automatización la primera vez que MacTools controle un navegador.
fr: macOS demandera l’autorisation d’automatisation lorsque MacTools contrôlera un navigateur pour la première fois.
ja: macOS は、初めてブラウザを制御するときにオートメーションの許可を求めます。
ko: macOS는 브라우저를 처음 제어할 때 자동화 권한을 요청합니다.
pt: O macOS solicitará permissão de Automação na primeira vez que o MacTools controlar um navegador.
ru: macOS запросит разрешение на автоматизацию при первом управлении браузером.
tr: macOS, bir tarayıcıyı ilk kez denetlediğinde otomasyon izni ister.
zh_hant: macOS 會在首次控制瀏覽器時要求自動化權限。

# permission.automation.status
source: 按需确认
ar: عند الطلب
de: Bei Bedarf
en: On demand
es: Bajo demanda
fr: À la demande
ja: 必要に応じて
ko: 필요 시
pt: Sob demanda
ru: По запросу
tr: Gerektiğinde
zh_hant: 按需確認

# settings.service.title
source: AI 服务
ar: خدمة الذكاء الاصطناعي
de: KI-Dienst
en: AI Service
es: Servicio de IA
fr: Service IA
ja: AIサービス
ko: AI 서비스
pt: Serviço de IA
ru: Служба ИИ
tr: Yapay Zekâ Servisi
zh_hant: AI 服務

# settings.provider.name.title
source: 名称
ar: الاسم
de: Name
en: Name
es: Nombre
fr: Nom
ja: 名前
ko: 이름
pt: Nome
ru: Имя
tr: Ad
zh_hant: 名稱

# settings.provider.name.description
source: 显示在处理结果卡片上。
ar: تظهر على بطاقة النتيجة.
de: Wird auf der Ergebniskarte angezeigt.
en: Shown on the result card.
es: Se muestra en la tarjeta de resultados.
fr: Affiché sur la carte de résultat.
ja: 結果カードに表示されます。
ko: 결과 카드에 표시됩니다.
pt: Exibido no cartão de resultados.
ru: Отображается на карточке результатов.
tr: Sonuç kartında gösterilir.
zh_hant: 顯示在處理結果卡片上。

# settings.provider.baseURL.title
source: 服务地址
ar: Base URL
de: Basis-URL
en: Base URL
es: URL base
fr: URL de base
ja: Base URL
ko: Base URL
pt: URL base
ru: Базовый URL
tr: Temel URL
zh_hant: 服務地址

# settings.provider.baseURL.description
source: OpenAI 或兼容网关地址。
ar: عنوان OpenAI أو بوابة متوافقة.
de: OpenAI-Adresse oder kompatibles Gateway.
en: OpenAI or compatible gateway address.
es: Dirección de OpenAI o de una puerta de enlace compatible.
fr: Adresse OpenAI ou passerelle compatible.
ja: OpenAI または互換ゲートウェイのアドレス。
ko: OpenAI 또는 호환 게이트웨이 주소입니다.
pt: Endereço da OpenAI ou de gateway compatível.
ru: Адрес OpenAI или совместимого шлюза.
tr: OpenAI veya uyumlu ağ geçidi adresi.
zh_hant: OpenAI 或相容閘道地址。

# settings.provider.apiKey.title
source: 接口密钥
ar: API Key
de: API-Schlüssel
en: API Key
es: Clave API
fr: Clé API
ja: API Key
ko: API Key
pt: Chave de API
ru: Ключ API
tr: API Anahtarı
zh_hant: 介面金鑰

# settings.provider.apiKey.description
source: 留空则保留当前钥匙串内容。
ar: اتركه فارغًا للاحتفاظ بإدخال Keychain الحالي.
de: Leer lassen, um den aktuellen Schlüsselbund-Eintrag beizubehalten.
en: Leave blank to keep the current Keychain entry.
es: Déjelo en blanco para mantener la entrada actual del Llavero.
fr: Laissez vide pour conserver l’entrée actuelle du trousseau.
ja: 空欄にすると、キーチェーンに保存されている現在の内容を保持します。
ko: 현재 키체인 항목을 유지하려면 비워 두세요.
pt: Deixe em branco para manter a entrada atual nas Chaves.
ru: Оставьте поле пустым, чтобы сохранить текущую запись связки ключей.
tr: Geçerli Keychain kaydını korumak için boş bırakın.
zh_hant: 留空則保留目前鑰匙圈內容。

# settings.provider.model.title
source: 模型
ar: النموذج
de: Modell
en: Model
es: Modelo
fr: Modèle
ja: モデル
ko: 모델
pt: Modelo
ru: Модель
tr: Model

# settings.provider.model.description
source: 用于处理的模型名称。
ar: اسم النموذج المستخدم للمعالجة.
de: Der für die Verarbeitung verwendete Modellname.
en: The model name used for processing.
es: El nombre del modelo utilizado para el procesamiento.
fr: Le nom du modèle utilisé pour le traitement.
ja: 処理に使用するモデル名。
ko: 처리에 사용되는 모델 이름입니다.
pt: O nome do modelo usado para processamento.
ru: Имя модели, используемое для обработки.
tr: İşlem için kullanılan modelin adı.
zh_hant: 用於處理的模型名稱。

# settings.modelList.help
source: 从可用模型中选择
ar: اختر من بين النماذج المتاحة
de: Aus verfügbaren Modellen wählen
en: Choose from available models
es: Elija entre los modelos disponibles
fr: Choisissez parmi les modèles disponibles
ja: 利用可能なモデルから選択してください
ko: 사용 가능한 모델 중에서 선택하세요
pt: Escolha entre os modelos disponíveis
ru: Выберите одну из доступных моделей
tr: Kullanılabilir modellerden seçin
zh_hant: 從可用模型中選擇

# settings.modelList.fetchHelp
source: 获取可用模型列表
ar: جلب النماذج المتاحة
de: Verfügbare Modelle abrufen
en: Fetch available models
es: Obtener modelos disponibles
fr: Récupérer les modèles disponibles
ja: 利用可能なモデルを取得する
ko: 사용 가능한 모델 가져오기
pt: Buscar modelos disponíveis
ru: Получить доступные модели
tr: Kullanılabilir modelleri getir
zh_hant: 取得可用模型清單

# settings.modelList.empty
source: 暂无可用模型，点击刷新获取
ar: لا توجد نماذج حتى الآن، انقر فوق تحديث للجلب
de: Noch keine Modelle vorhanden; zum Abrufen auf „Aktualisieren“ klicken.
en: No models yet. Click Refresh to fetch them.
es: Aún no hay modelos, haga clic en actualizar para recuperarlos
fr: Aucun modèle pour l’instant ; cliquez sur Actualiser pour récupérer la liste.
ja: モデルがまだありません。更新をクリックして取得してください
ko: 아직 모델이 없습니다. 가져오려면 새로고침을 클릭하세요.
pt: Ainda não há modelos, clique em atualizar para buscar
ru: Моделей пока нет. Для просмотра нажмите «Обновить».
tr: Henüz model yok; getirmek için yenile düğmesine tıklayın
zh_hant: 暫無可用模型，點擊重新整理取得

# settings.modelList.emptyResult
source: 未返回可用模型
ar: لم يتم إرجاع أي نماذج.
de: Keine Modelle zurückgegeben.
en: No models returned.
es: No se devolvieron modelos.
fr: Aucun modèle retourné.
ja: モデルは返されませんでした。
ko: 반환된 모델이 없습니다.
pt: Nenhum modelo foi retornado.
ru: Сервис не вернул ни одной модели.
tr: Model döndürülmedi.
zh_hant: 未回傳可用模型

# settings.modelList.unavailable
source: 暂时无法获取模型列表
ar: يتعذر جلب قائمة النماذج الآن.
de: Die Modellliste kann derzeit nicht abgerufen werden.
en: Unable to fetch the model list right now.
es: No se puede recuperar la lista de modelos en este momento.
fr: Impossible de récupérer la liste des modèles pour le moment.
ja: 現在モデルリストを取得できません。
ko: 지금은 모델 목록을 가져올 수 없습니다.
pt: Não é possível obter a lista de modelos no momento.
ru: Сейчас невозможно получить список моделей.
tr: Model listesi şu anda getirilemiyor.
zh_hant: 暫時無法取得模型清單

# settings.test.title
source: 测试连接
ar: اختبار
de: Test
en: Test
es: Prueba
fr: Tester
ja: テスト
ko: 테스트
pt: Teste
ru: Тест
tr: Test
zh_hant: 測試驗證

# settings.test.prompt
source: 请回复：连接成功
ar: الرجاء الرد: تم الاتصال بنجاح
de: Bitte antworten: Verbindung erfolgreich
en: Please reply: connection successful
es: Por favor responda: conexión exitosa
fr: Veuillez répondre : connexion réussie
ja: 返信してください: 接続が成功しました
ko: 다음과 같이 응답하세요: 연결 성공
pt: Por favor responda: conexão bem-sucedida
ru: Пожалуйста, ответьте: подключение выполнено успешно.
tr: Lütfen yanıtlayın: bağlantı başarılı
zh_hant: 請回覆：連線成功

# settings.test.success
source: 连接成功
ar: تم الاتصال بنجاح
de: Verbindung erfolgreich
en: Connection successful
es: Conexión exitosa
fr: Connexion réussie
ja: 接続成功
ko: 연결 성공
pt: Conexão bem-sucedida
ru: Соединение выполнено успешно
tr: Bağlantı başarılı
zh_hant: 連線成功

# settings.test.unavailable
source: 暂时无法测试连接
ar: يتعذر اختبار الاتصال الآن.
de: Die Verbindung kann derzeit nicht getestet werden.
en: Unable to test the connection right now.
es: No se puede probar la conexión en este momento.
fr: Impossible de tester la connexion pour le moment.
ja: 現在接続をテストできません。
ko: 현재 연결을 테스트할 수 없습니다.
pt: Não é possível testar a conexão no momento.
ru: Сейчас невозможно проверить соединение.
tr: Bağlantı şu anda test edilemiyor.
zh_hant: 暫時無法測試連線

# settings.prompt.temperature.title
source: 温度
ar: درجة الحرارة
de: Temperatur
en: Temperature
es: Temperatura
fr: Température
ko: 온도
pt: Temperatura
ru: Температура
tr: Sıcaklık
zh_hant: 溫度

# settings.prompt.temperature.description
source: 0-2，控制输出创造力与稳定性，默认 0.7。
ar: 0-2. يتحكم في إبداع الإخراج واستقراره؛ 0.7 بشكل افتراضي.
de: 0–2. Steuert die Kreativität und Stabilität der Ausgabe; Standardwert ist 0,7.
en: 0-2. Controls output creativity and stability; 0.7 by default.
es: 0-2. Controla la creatividad y la estabilidad de la salida; 0,7 por defecto.
fr: 0-2. Contrôle la créativité et la stabilité des résultats ; 0,7 par défaut.
ja: 0-2。出力の創造性と安定性を制御します。デフォルトでは 0.7 です。
ko: 0-2. 출력 창의성과 안정성을 제어합니다. 기본적으로 0.7입니다.
pt: 0–2. Controla a criatividade e a estabilidade da resposta; 0,7 por padrão.
ru: 0–2. Определяет творческий характер и стабильность ответов; по умолчанию — 0,7.
tr: 0-2. Çıktının yaratıcılığını ve dengesini denetler; varsayılan değer 0.7.
zh_hant: 0-2，控制輸出創造力與穩定性，預設 0.7。

# settings.prompt.temperature.resetHelp
source: 重置温度为 0.7
ar: إعادة ضبط درجة الحرارة إلى 0.7
de: Temperatur auf 0,7 zurücksetzen
en: Reset temperature to 0.7
es: Restablecer la temperatura a 0,7
fr: Réinitialiser la température à 0,7
ja: 温度を0.7にリセット
ko: 온도를 0.7로 재설정
pt: Redefinir temperatura para 0,7
ru: Сбросить температуру до 0,7
tr: Sıcaklığı 0.7'ye sıfırla
zh_hant: 重設溫度為 0.7

# settings.provider.name.placeholder
source: AI 服务
ar: خدمة الذكاء الاصطناعي
de: KI-Dienst
en: AI Service
es: Servicio de IA
fr: Service IA
ja: AIサービス
ko: AI 서비스
pt: Serviço de IA
ru: Служба ИИ
tr: Yapay Zekâ Servisi
zh_hant: AI 服務

# settings.provider.reasoning.title
source: 请求思考过程
ar: طلب الاستدلال
de: Denkprozess anfordern
en: Request Reasoning
es: Solicitar razonamiento
fr: Demander un raisonnement
ja: 推論を要求
ko: 추론 요청
pt: Solicitar raciocínio
ru: Запрашивать рассуждения
tr: Akıl Yürütme İsteği
zh_hant: 請求思考過程

# settings.provider.reasoning.description
source: 为 DeepSeek / Qwen 等推理模型在请求中启用思考字段。
ar: قم بتضمين حقل طلب الاستدلال لنماذج التفكير بأسلوب DeepSeek / Qwen.
de: Feld für die Anforderung des Denkprozesses (Reasoning) für Modelle im DeepSeek-/Qwen-Stil einbeziehen.
en: Include the reasoning request field for DeepSeek / Qwen style thinking models.
es: Incluye el campo de razonamiento en las solicitudes para modelos de razonamiento como DeepSeek y Qwen.
fr: Inclut le champ de demande de raisonnement pour les modèles de raisonnement de type DeepSeek / Qwen.
ja: DeepSeek / Qwen などの推論モデルで、リクエストに思考プロセス用のフィールドを含めます。
ko: DeepSeek / Qwen 등 추론 모델에 맞게 요청에 추론 필드를 포함합니다.
pt: Inclua o campo de solicitação de raciocínio para modelos de raciocínio como DeepSeek e Qwen.
ru: Добавлять поле запроса рассуждений для моделей DeepSeek, Qwen и других моделей с режимом рассуждений.
tr: DeepSeek / Qwen tarzı düşünür modeller için akıl yürütme isteği alanını içerir.
zh_hant: 為 DeepSeek / Qwen 等推理模型在請求中啟用思考欄位。

# settings.prompts.title
source: 处理模板
ar: التوجيهات
de: Prompts
en: Prompts
es: Prompts
fr: Prompts
ja: プロンプト
ko: 프롬프트
pt: Prompts
ru: Промпты
tr: İstemler
zh_hant: 處理模組

# settings.promptList.add
source: 添加
ar: إضافة
de: Hinzufügen
en: Add
es: Añadir
fr: Ajouter
ja: 追加
ko: 추가
pt: Adicionar
ru: Добавить
tr: Ekle
zh_hant: 新增

# settings.prompt.namePlaceholder
source: 模板名称
ar: اسم التوجيه
de: Prompt-Name
en: Prompt name
es: Nombre del prompt
fr: Nom du prompt
ja: プロンプト名
ko: 프롬프트 이름
pt: Nome do prompt
ru: Название промпта
tr: İstem adı
zh_hant: 模板名稱

# settings.prompt.template.placeholder
source: 请将以下内容翻译为英文： {{text}}
ar: ترجم النص التالي إلى الإنجليزية: {{text}}
de: Übersetze den folgenden Text ins Englische: {{text}}
en: Translate the following into English: {{text}}
es: Traduce lo siguiente al inglés: {{text}}
fr: Traduisez le texte suivant en anglais : {{text}}
ja: 次の文章を英語に翻訳してください: {{text}}
ko: 다음을 영어로 번역하세요: {{text}}
pt: Traduza o seguinte para o inglês: {{text}}
ru: Переведите следующий текст на английский: {{text}}
tr: Aşağıdakini İngilizceye çevir: {{text}}
zh_hant: 請將以下內容翻譯為英文： {{text}}

# settings.prompt.systemPrompt.placeholder
source: 设定 AI 角色的背景人设、语气或格式规则（可选）...
ar: حدّد شخصية الذكاء الاصطناعي أو نبرة الرد أو قواعد التنسيق (اختياري)...
de: KI-Persona, Tonalität oder Formatierungsregeln festlegen (optional)...
en: Set the AI persona, tone, or formatting rules (optional)...
es: Establece las reglas de formato, tono o personalidad de IA (opcional)...
fr: Définissez le personnage, le ton ou les règles de formatage de l'IA (facultatif)...
ja: AI の役割、口調、出力形式のルールを設定（任意）...
ko: AI 페르소나, 어조, 서식 규칙 설정(선택 사항)...
pt: Defina a personalidade, o tom ou as regras de formatação da IA (opcional)...
ru: Задайте роль ИИ, тон или правила форматирования (необязательно)...
tr: Yapay zekânın kişiliğini, üslubunu veya biçim kurallarını ayarlayın (isteğe bağlı)...
zh_hant: 設定 AI 角色的背景人設、語氣或格式規則（可選）...

# settings.promptRow.edit
source: 编辑
ar: تحرير
de: Bearbeiten
en: Edit
es: Editar
fr: Modifier
ja: 編集
ko: 편집
pt: Editar
ru: Изменить
tr: Düzenle
zh_hant: 編輯

# settings.prompt.save
source: 保存
ar: حفظ
de: Sichern
en: Save
es: Guardar
fr: Enregistrer
ko: 저장
pt: Salvar
ru: Сохранить
tr: Kaydet
zh_hant: 儲存

# settings.prompt.cancel
source: 取消
ar: إلغاء
de: Abbrechen
en: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
tr: İptal

# settings.prompt.error.emptyName
source: 模板名称不能为空
ar: لا يمكن أن يكون اسم التوجيه فارغًا.
de: Der Prompt-Name darf nicht leer sein.
en: Prompt name cannot be empty.
es: El nombre del prompt no puede estar vacío.
fr: Le nom du prompt ne peut pas être vide.
ja: プロンプト名を空にすることはできません。
ko: 프롬프트 이름은 비워둘 수 없습니다.
pt: O nome do prompt não pode ficar vazio.
ru: Название промпта не может быть пустым.
tr: İstem adı boş olamaz.
zh_hant: 模板名稱不能為空

# settings.prompt.error.duplicateName
source: 模板名称与现有模板重复
ar: اسم التوجيه موجود بالفعل.
de: Der Prompt-Name existiert bereits.
en: Prompt name already exists.
es: El nombre del prompt ya existe.
fr: Le nom du prompt existe déjà.
ja: プロンプト名はすでに存在します。
ko: 프롬프트 이름이 이미 존재합니다.
pt: O nome do prompt já existe.
ru: Промпт с таким названием уже существует.
tr: Bu istem adı zaten kullanılıyor.
zh_hant: 模板名稱與現有模板重複

# settings.prompt.deleteConfirm.title
source: 删除处理模板？
ar: هل تريد حذف هذا التوجيه؟
de: Diesen Prompt löschen?
en: Delete this prompt?
es: ¿Eliminar este prompt?
fr: Supprimer ce prompt ?
ja: このプロンプトを削除しますか?
ko: 이 프롬프트를 삭제하시겠습니까?
pt: Excluir este prompt?
ru: Удалить этот промпт?
tr: Bu istem silinsin mi?
zh_hant: 確認刪除處理模組？

# settings.prompt.deleteConfirm.message
source: 确定要删除「%@」吗？删除后快捷键与相关配置将一并失效，且无法恢复。
ar: حذف "%@"؟ يتوقف الاختصار والإعدادات ذات الصلة عن العمل ولا يمكن استعادتها.
de: „%@“ löschen? Die Tastenkombination und die zugehörigen Einstellungen funktionieren danach nicht mehr und können nicht wiederhergestellt werden.
en: Delete “%@”? Its shortcut and related settings stop working and cannot be restored.
es: ¿Eliminar «%@»? Su atajo de teclado y los ajustes relacionados dejarán de funcionar y no se podrán restaurar.
fr: Supprimer « %@ » ? Son raccourci et les paramètres associés cessent de fonctionner et ne peuvent pas être restaurés.
ja: 「%@」を削除しますか？そのショートカットと関連設定は動作を停止し、復元できません。
ko: ‘%@’을(를) 삭제하시겠습니까? 단축키 및 관련 설정이 작동을 멈추고 복원할 수 없습니다.
pt: Excluir “%@”? Seu atalho e configurações relacionadas param de funcionar e não podem ser restaurados.
ru: Удалить «%@»? Его сочетание клавиш и связанные настройки будут безвозвратно удалены.
tr: “%@” silinsin mi? Kısayolu ve ilgili ayarları çalışmayı durur ve geri getirilemez.
zh_hant: 確定要刪除「%@」嗎？刪除後快速鍵與相關設定將一併失效，且無法恢復。
